#Использовать asserts
#Использовать WinExt

Перем юТест;
Перем Форма;
Перем ТекстПроверки;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_НайтиФрагмент");
	СписокТестов.Добавить("Тест_Должен_ВернутьРазрешениеЭкрана");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_НайтиФрагмент() Экспорт

	Экран = Новый Экран();

	ПутьКФрагменту = Новый Файл("fixtures/vscode.png").ПолноеИмя;
	ФрагментЭкрана = Экран.НайтиФрагмент(ПутьКФрагменту);

	Ожидаем.Что(ФрагментЭкрана).Существует();

	Если ФрагментЭкрана <> Неопределено Тогда
		Сообщить("Верх: " + ФрагментЭкрана.Верх);
		Сообщить("Лево: " + ФрагментЭкрана.Лево);
	КонецЕсли;

КонецПроцедуры

Процедура Тест_Должен_ВернутьРазрешениеЭкрана() Экспорт

	Экран = Новый Экран();
	Разрешение = Экран.РазрешениеЭкрана();

	Ожидаем.Что(Разрешение.Ширина).Равно(1920);
	Ожидаем.Что(Разрешение.Высота).Равно(1080);

КонецПроцедуры
