#Использовать asserts
#Использовать WinExt

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_СделатьСнимокЭкранаPNG");
	СписокТестов.Добавить("Тест_Должен_СделатьСнимокЭкранаJPG");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_СделатьСнимокЭкранаPNG() Экспорт

	ИмяВременногФайла = ПолучитьИмяВременногоФайла("png");

	Экран = Новый Экран();
	Экран.СделатьСнимок(ИмяВременногФайла);
	Результат = Новый Файл(ИмяВременногФайла);

	Ожидаем.Что(Результат).Существует();

КонецПроцедуры

Процедура Тест_Должен_СделатьСнимокЭкранаJPG() Экспорт

	ИмяВременногФайла = ПолучитьИмяВременногоФайла("jpg");

	Экран = Новый Экран();
	Экран.СделатьСнимок(ИмяВременногФайла);
	Результат = Новый Файл(ИмяВременногФайла);

	Ожидаем.Что(Результат).Существует();

КонецПроцедуры
