#Использовать asserts
#Использовать WinExt

Перем юТест;
Перем Форма;
Перем ТекстПроверки;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_УстановитьПозициюКурсора");
	СписокТестов.Добавить("Тест_Должен_ВернутьПозициюКурсора");
	СписокТестов.Добавить("Тест_Должен_КликнутьЛевойКнопкой");
	СписокТестов.Добавить("Тест_Должен_КликнутьПравойКнопкой");
	СписокТестов.Добавить("Тест_Должен_КликнутьСреднейКнопкой");
	
	СписокТестов.Добавить("Тест_Должен_ДвойнойКликЛевойКнопкой");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_УстановитьПозициюКурсора() Экспорт

	Мышь = Новый Мышь();
	Результат = Мышь.УстановитьПозициюКурсора(200, 250);

	Ожидаем.Что(Результат).Равно(Истина);

КонецПроцедуры

Процедура Тест_Должен_ВернутьПозициюКурсора() Экспорт

	Мышь = Новый Мышь();
	Результат = Мышь.ПолучитьПозициюКурсора();

	Ожидаем.Что(Результат.Верх).Равно(250);
	Ожидаем.Что(Результат.Лево).Равно(200);

КонецПроцедуры

Процедура Тест_Должен_КликнутьЛевойКнопкой() Экспорт

	Мышь = Новый Мышь();
	Мышь.ЛеваяКнопкаКлик(200, 270);

КонецПроцедуры

Процедура Тест_Должен_ДвойнойКликЛевойКнопкой() Экспорт

	Мышь = Новый Мышь();

	Мышь.ЛеваяКнопкаКлик(200, 270);
	Приостановить(50);
	Мышь.ЛеваяКнопкаКлик(200, 270);

КонецПроцедуры

Процедура Тест_Должен_КликнутьПравойКнопкой() Экспорт

	Мышь = Новый Мышь();
	Мышь.ПраваяКнопкаКлик(270, 270);

КонецПроцедуры

Процедура Тест_Должен_КликнутьСреднейКнопкой() Экспорт

	Мышь = Новый Мышь();
	Мышь.СредняяКнопкаКлик(700, 50);

КонецПроцедуры

