#Использовать asserts
#Использовать WinExt

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_НажатьКнопкуНайтиФрагмент");
	СписокТестов.Добавить("Тест_Должен_ВернутьНеопределено");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_НажатьКнопкуНайтиФрагмент() Экспорт

	ПутьКФорме = Новый Файл("fixtures/testForm.os").ПолноеИмя;

	Процесс = СоздатьПроцесс("oscript " + ПутьКФорме);
	Процесс.Запустить();

	Приостановить(2000);

	Экран = Новый Экран();

	ПутьКФрагменту = Новый Файл("fixtures/btnPressMe.png").ПолноеИмя;
	ФрагментЭкранаКнопка = Экран.НайтиФрагмент(ПутьКФрагменту);

	Ожидаем.Что(ФрагментЭкранаКнопка).Существует();

	Если ФрагментЭкранаКнопка <> Неопределено Тогда

		Лево = ФрагментЭкранаКнопка.Лево + (ФрагментЭкранаКнопка.Ширина / 2);
		Верх = ФрагментЭкранаКнопка.Верх + (ФрагментЭкранаКнопка.Высота / 2);

		Мышь = Новый Мышь();
		Мышь.ЛеваяКнопкаКлик(Лево, Верх);

		ПутьКФрагменту = Новый Файл("fixtures/textFieldAfterBtnPress.png").ПолноеИмя;
		ФрагментЭкранаРезультат = Экран.НайтиФрагмент(ПутьКФрагменту);

		Ожидаем.Что(ФрагментЭкранаРезультат, "Нет фрагмента: После нажатия кнопки").Существует();
		
	КонецЕсли;

	Процесс.Завершить();

КонецПроцедуры

Процедура Тест_Должен_ВернутьНеопределено() Экспорт

	ПутьКФорме = Новый Файл("fixtures/testForm.os").ПолноеИмя;

	Процесс = СоздатьПроцесс("oscript " + ПутьКФорме);
	Процесс.Запустить();

	Приостановить(2000);

	Экран = Новый Экран();

	ПутьКФрагменту = Новый Файл("fixtures/btnPressMe.png").ПолноеИмя;
	ФрагментЭкранаКнопка = Экран.НайтиФрагмент(ПутьКФрагменту);

	Ожидаем.Что(ФрагментЭкранаКнопка).Существует();

	Если ФрагментЭкранаКнопка <> Неопределено Тогда

		Лево = ФрагментЭкранаКнопка.Лево + (ФрагментЭкранаКнопка.Ширина / 2);
		Верх = ФрагментЭкранаКнопка.Верх + (ФрагментЭкранаКнопка.Высота / 2);

		Мышь = Новый Мышь();
		Мышь.ЛеваяКнопкаКлик(Лево, Верх);

		ПутьКФрагменту = Новый Файл("fixtures/textFieldBeforeBtnPress.png").ПолноеИмя;

		ФрагментЭкранаТекстовоеПоле = Экран.НайтиФрагмент(ПутьКФрагменту);
		Сообщить("Ширина: " + ПутьКФрагменту);

		Ожидаем.Что(ФрагментЭкранаТекстовоеПоле, "Нет фрагмента: До нажатия кнопки").ЭтоНеопределено();
		
	КонецЕсли;

	Процесс.Завершить();

КонецПроцедуры
